Catalogs/ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ДоговорыКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролироватьКвоты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПроверятьПросроченнуюЗадолженность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварныйКредит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПродления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПродленияДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравоСобственности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоАренда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактАренда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭлектронныйАренда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыдачаСКассы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ЦеныКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЦеныКонтрагентов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен для которого хранятся цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Comment>(АСУ) Характеристика/серия номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыСПоставщикамиПоДокументам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСПоставщикамиПоДокументам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма долга в валюте взаиморасчетов с контрагентом</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБаз</Name>
					<Comment>Содержит сумму в базовой валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции взаиморасчетов (оплата, предоплата...)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегламентированныйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТипыСделок</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыСПокупателямиПоДокументам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСПокупателямиПоДокументам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма долга в валюте взаиморасчетов с контрагентом</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБаз</Name>
					<Comment>Содержит сумму в базовой валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции взаиморасчетов (оплата, предоплата...)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегламентированныйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТипыСделок</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СрокиОплатПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СрокиОплатПоДоговорам</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОплатыПоДоговору</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дней2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыДоговоровКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ДоговорыКонтрагентов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс


// Возвращает список доступных видов договора для документа.
//
// Параметры
//	Документ  - любой документ, предусматривающий договор контрагента
//	ВидОперации  - вид операции документа.
//
// Возвращаемое значение:
//	<СписокЗначений>   - список видов договора, доступных для документа.
//
Функция ПолучитьСписокВидовДоговораДляДокумента(Документ, ВидОперации = Неопределено, ИмяТабличнойЧасти = "") Экспорт
	
	СписокВидовДоговора = Новый СписокЗначений;
	ТипДокумента = ТипЗнч(Документ);
	
	Если ТипДокумента = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		
		Если ВидОперации = ПредопределенноеЗначение("Справочник.ХозОперации.ПоступлениеТоваров")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Справочник.ХозОперации.ПоступлениеТоваровТранзиты")Тогда
			
			СписокВидовДоговора.Добавить(ПредопределенноеЗначение("Справочник.ВидыДоговоров.Поставка"));
			СписокВидовДоговора.Добавить(ПредопределенноеЗначение("Справочник.ВидыДоговоров.ПоставкаПереводДолга"));
			
		ИначеЕсли ВидОперации = ПредопределенноеЗначение("Справочник.ХозОперации.ПоступлениеТоваровКомиссия") Тогда
			
			СписокВидовДоговора.Добавить(ПредопределенноеЗначение("Справочник.ВидыДоговоров.КомиссияПоставка"));
			
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВозвратПоставщику") ИЛИ ТипДокумента = Тип("ДокументСсылка.ТК_ЗаявкаНаВозвратПоставщику") Тогда 
		
		Если ВидОперации = ПредопределенноеЗначение("Справочник.ХозОперации.ВозвратТоваровПоставщику")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Справочник.ХозОперации.ВозвратТоваровПоставщикуТранзиты") 
			ИЛИ ВидОперации = ПредопределенноеЗначение("Справочник.ХозОперации.ЗаявкаНаВозвратПоставщику") 
			ИЛИ ВидОперации = ПредопределенноеЗначение("Справочник.ХозОперации.ЗаявкаНаВозвратПоставщикуТранзиты") Тогда 
			
			СписокВидовДоговора.Добавить(ПредопределенноеЗначение("Справочник.ВидыДоговоров.Поставка"));
			СписокВидовДоговора.Добавить(ПредопределенноеЗначение("Справочник.ВидыДоговоров.ПоставкаПереводДолга"));
			
		ИначеЕсли ВидОперации = ПредопределенноеЗначение("Справочник.ХозОперации.ВозвратТоваровПоставщикуКомиссия") Тогда 			
			
			СписокВидовДоговора.Добавить(ПредопределенноеЗначение("Справочник.ВидыДоговоров.КомиссияПоставка"));
			
		КонецЕсли;
	
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЗаказПокупателя")
		ИЛИ ТипДокумента = Тип("ДокументСсылка.ВозвратОтПокупателя")
		ИЛИ ТипДокумента = Тип("ДокументСсылка.РеализацияТоваров")
		ИЛИ ТипДокумента = Тип("ДокументСсылка.ВыпускПродукции") Тогда 
		
		СписокВидовДоговора.Добавить(ПредопределенноеЗначение("Справочник.ВидыДоговоров.Продажа"));
		
	КонецЕсли;
	
	
	Возврат СписокВидовДоговора;
	
КонецФункции // ПолучитьСписокВидовДоговораДляДокумента()

// Получает договор контрагента по умолчанию с учетом условий отбора. Возвращается основной договор или единственный или пустую ссылку.
//
// Параметры
//  Контрагент	–	<СправочникСсылка.Контрагенты> 
//							Контрагент, договор которого нужно получить
//  Организация	–	<СправочникСсылка.Организации> 
//							Организация, договор которой нужно получить
//  Подразделение –	<СправочникСсылка.ПодразделенияКомпании> 
//  СписокВидовДоговора	–	<Массив> или <СписокЗначений>, состоящий из значений типа <ПеречислениеСсылка.ВидыДоговоров> 
//							Нужные виды договора
//
// Возвращаемое значение:
//   <СправочникСсылка.ДоговорыКонтрагентов> – найденный договор или пустая ссылка
//
Функция ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора(Контрагент, Организация, Подразделение, СписокВидовДоговора = Неопределено, ВалютаРасчетов = Неопределено, ДатаДоговора,НомерДоговора= Неопределено,ТорговаяПлощадка = Неопределено,Менеджер=Неопределено) Экспорт
	
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Контрагент = &Контрагент
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
	|	И НЕ ДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(перечисление.СтатусыДоговоровКонтрагентов.Закрыт)
	|	И ДоговорыКонтрагентов.Подразделение = &Подразделение
	|	И (ДоговорыКонтрагентов.ДатаНачалаДействия <= &ДатаДоговора
	|				И ДоговорыКонтрагентов.ДатаОкончанияДействия = &ПустаяДата
	|			ИЛИ &ДатаДоговора МЕЖДУ ДоговорыКонтрагентов.ДатаНачалаДействия И ДоговорыКонтрагентов.ДатаОкончанияДействия)"
	+?(СписокВидовДоговора <> Неопределено,"
	|	И ДоговорыКонтрагентов.ВидДоговора В (&СписокВидовДоговора)","")
	+?(НомерДоговора <> Неопределено,"
	|	И ДоговорыКонтрагентов.Номер = (&НомерДоговора)","")
	+?(ВалютаРасчетов <> Неопределено,"
	|	И ДоговорыКонтрагентов.ВалютаВзаиморасчетов = (&ВалютаРасчетов)","")
	+?(Менеджер <> Неопределено,"
	|	И ДоговорыКонтрагентов.Менеджер = &Менеджер","")
	+?(ТорговаяПлощадка <> Неопределено,"
	|	И ДоговорыКонтрагентов.ТорговаяПлощадка = &ТорговаяПлощадка","")+"
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДоговорыКонтрагентов.ДатаНачалаДействия УБЫВ,
	|	ДоговорыКонтрагентов.ДатаОкончанияДействия";
	
	
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("ДатаДоговора",ДатаДоговора);
	Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101"));
	Запрос.УстановитьПараметр("СписокВидовДоговора", СписокВидовДоговора);
	Запрос.УстановитьПараметр("ВалютаРасчетов", ВалютаРасчетов);
	Запрос.УстановитьПараметр("НомерДоговора", НомерДоговора);
	Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадка);
	Запрос.УстановитьПараметр("Менеджер", Менеджер);
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Выборка.Следующий();
	Возврат Выборка.Ссылка;

КонецФункции // ПолучитьДоговорКонтрагента()

Функция ПолучитьСогласованныйДоговорПоНоменклатуре(Организация,ПодразделениеКомпании,Контрагент,Номенклатура)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЦеныКонтрагентовСрезПоследних.Регистратор.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов
		|ИЗ
		|	РегистрСведений.ЦеныКонтрагентов.СрезПоследних(
		|			,
		|			Контрагент = &Контрагент
		|				И Номенклатура = &Номенклатура
		|				И Регистратор.Организация = &Организация
		|				И Регистратор.ПодразделениеКомпании = &ПодразделениеКомпании) КАК ЦеныКонтрагентовСрезПоследних";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	Возврат ВыборкаДетальныеЗаписи.ДоговорВзаиморасчетов;
	
КонецФункции


// Получает таблицу доступных договоров по переданным параметрам
//
// Параметры
//  Параметры	–	<Структура> 
//							Параметры отбора договоров
//
// Возвращаемое значение:
//   <ТаблицаЗначений> – Таблица найденных договоров
//
Функция ПолучитьДоступныеДоговоры(Параметры) Экспорт
	
	Запрос = Новый Запрос;
		
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Договоры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК Договоры
				   |	%1
	               |ГДЕ
	               |	Договоры.Контрагент = &Контрагент
				   |	%2";
	
	ТекстСоединений = "";
	ТекстОтборов = "";
	            
	Запрос.УстановитьПараметр("Контрагент", Параметры.Контрагент);
	Если Параметры.Свойство("Организация") тогда
		ТекстОтборов = ТекстОтборов + "И (Договоры.Организация=ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) ИЛИ Договоры.Организация=&Организация)" + Символы.ПС;
		Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	КонецЕсли;
	
	Если Параметры.Свойство("Подразделение") тогда
		ТекстОтборов = ТекстОтборов + "И (Договоры.Подразделение = &Подразделение ИЛИ Договоры.Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ПустаяСсылка))" + Символы.ПС;		
		Запрос.УстановитьПараметр("Подразделение", Параметры.Подразделение);
	КонецЕсли;
	
	Если Параметры.Свойство("Дата") тогда
		
		Запрос.УстановитьПараметр("Дата", Параметры.Дата);
		
		Если Не ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Незакрытые", Ложь) Тогда 
			
			ТекстОтборов = ТекстОтборов + "И Договоры.ДатаНачалаДействия < &Дата
										|И (Договоры.ДатаОкончанияДействия > &Дата
										|		ИЛИ Договоры.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))";
		Иначе
			
			ТекстСоединений = "		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Остатки(&Дата, Контрагент = &Контрагент) КАК РасчетыСПоставщикамиПоДокументамОстатки
								|		ПО (РасчетыСПоставщикамиПоДокументамОстатки.ДоговорВзаиморасчетов = Договоры.Ссылка)
								|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПокупателямиПоДокументам.Остатки(&Дата, Контрагент = &Контрагент) КАК РасчетыСПокупателямиПоДокументамОстатки
								|		ПО (РасчетыСПокупателямиПоДокументамОстатки.ДоговорВзаиморасчетов = Договоры.Ссылка)";
			
			ТекстОтборов = ТекстОтборов + "И ЕСТЬNULL(РасчетыСПоставщикамиПоДокументамОстатки.СуммаОстаток, 0) <> 0 И ЕСТЬNULL(РасчетыСПокупателямиПоДокументамОстатки.СуммаОстаток, 0) <> 0" + Символы.ПС;
			
		КонецЕсли;		
		
	КонецЕсли;
	
	Если Параметры.Свойство("ВидДоговора") тогда
		ТекстОтборов = ТекстОтборов + "И Договоры.ВидДоговора В (&ВидДоговора)" + Символы.ПС;
		Запрос.УстановитьПараметр("ВидДоговора", Параметры.ВидДоговора);
	КонецЕсли;
		
	Если Параметры.Свойство("Валюта") тогда
		ТекстОтборов = ТекстОтборов + "И Договоры.ВалютаВзаиморасчетов=&Валюта";
		Запрос.УстановитьПараметр("Валюта", Параметры.Валюта);
	КонецЕсли;
	
	Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗапроса, ТекстСоединений, ТекстОтборов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)
	|	И ЗначениеРазрешено(Менеджер)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры


Функция СрокОплатыПоДоговору(Знач Период = Неопределено,ДоговорКонтрагента)Экспорт
	
	//УстановитьПривилегированныйРежим(Истина);
	
	Если Период = Неопределено Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("Ф1,Ф2",0,0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СрокиОплатПоДоговорамСрезПоследних.Дней КАК Ф1,
		|	СрокиОплатПоДоговорамСрезПоследних.Дней2 КАК Ф2
		|ИЗ
		|	РегистрСведений.СрокиОплатПоДоговорам.СрезПоследних(&НаДату, ДоговорКонтрагента = &ДоговорКонтрагента) КАК СрокиОплатПоДоговорамСрезПоследних";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	Запрос.УстановитьПараметр("НаДату", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;	
		
		
		
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	ЗаполнитьЗначенияСвойств(СтруктураВозврата,ВыборкаДетальныеЗаписи);
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьДоговорСогласованнойЦены(Период,Подразделение,Контрагент,Договор=Неопределено,Номенклатура)Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Согл.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов
		|ИЗ
		|	РегистрСведений.СогласованиеЦен.СрезПоследних(
		|			&Период,
		|			Контрагент = &Контрагент
		|				И ДоговорВзаиморасчетов.Подразделение = &Подразделение
		|				И Номенклатура = &Номенклатура) КАК Согл
		|ГДЕ
		|	Согл.СрокДействия >= &Период
		|	И Согл.Цена <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Согл.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Договор;
	КонецЕсли;
	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий(); 

	Возврат ВыборкаДетальныеЗаписи.ДоговорВзаиморасчетов;

	
КонецФункции



Функция ПолучитьДоговорПоКлючуФоновогоЗадания(КлючФоновогоЗадания) Экспорт

	ПозицияРазделителя = Найти(КлючФоновогоЗадания, "UID#");
	
	УникальныйИдентификаторСклада = Сред(КлючФоновогоЗадания, ПозицияРазделителя + 4);
	
	Возврат Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(Новый УникальныйИдентификатор(УникальныйИдентификаторСклада));

КонецФункции // ПолучитьСкладПоКлючуФоновогоЗадания()

Функция ПолучитьКлючФоновогоЗаданияПоДоговора(Договор) Экспорт

	Возврат СокрЛП(Договор.Наименование) + ", UID#" + Договор.УникальныйИдентификатор();	

КонецФункции // ПолучитьКлючФоновогоЗаданияПоСкладу()




#КонецОбласти






#КонецЕсли
